{
  "offers": [
    {
      "category": "Writing",
      "position": "Marketing Copywriter",
      "url": "https://student-loan-hero.workable.com/jobs/399078",
      "remote": true,
      "location": "Anywhere",
      "company": "Student Loan Hero",
      "companyUrl": "https://jobspresso.co/company/Student+Loan+Hero/",
      "companyAbout": "\n                    About Student Loan Hero\n                    Student Loan Hero is the smartest way for student loan borrowers to repay student loans, saving time, money and frustration.\nOur student loan tools allow a student loan borrower to sync student loan data, learn about 70+ federal and private and repayment options, and calculate different repayment scenarios.\nStudent Loan Hero is helping 60,000+ borrowers manage and eliminate over $1 billion dollars in student loan debt. We're on a mission to help 43 million Americans manage their student loans smarter. Each year, it helps more than one million people become financially healthy.\nFor both current and former students who want to manage their loans in line within their own budget, Student Loan Hero offers free loan calculators, unbiased personalized advice, and repayment plans, all with a user-friendly interface and dashboard.\n                ",
      "companyImage": "https://jobspresso.co/wp-content/uploads/2016/04/zzf1jQF31.png",
      "text": "Student Loan Hero (SLH) combines financial education with easy-to-use tools to help the millions of Americans living with student loan debt to manage their student loans smarter.\nFounded in 2012, Student Loan Hero is helping 100,000+ borrowers manage and eliminate over $2 billion dollars in student loan debt. We’re on a mission to help 44 million Americans manage their student loans smarter.\nFor both current and former students who want to manage their loans in line within their own budget, Student Loan Hero offers free loan calculators, unbiased personalized advice, and repayment plans, all with a user-friendly interface and dashboard.\nWhat does the Marketing Copywriter do?\nThe Marketing Copywriter’s role is to take web pages, emails, and other content and create copy that improves conversion rates and gets results.\nWe’re looking for a Marketing Copywriter who will:\n\nLocate weak spots in SLH’s copy and propose, create, and A/B test new copy\nIncrease conversion rates with the copy s/he writes\nHelp develop new email marketing funnels as well as improve our existing ones\nFind the right words to educate, inspire, and motivate users to take action\nCreate clear and engaging copy that’s honest and helpful (and not hype)\nFocus on results — you’re not satisfied merely creating new copy and calling it a day. Rather, you’re focused on making sure what you produce gets the desired results.\n\nThe ideal candidate for this position should have an entrepreneurial mind-set and be ready to take on and initiate new projects as he or she sees the need arise.\nWhat’s it like to work on the Student Loan Hero team?\nStudent Loan Hero is a fully remote team. We have team members all over the world in cities including NYC, Austin, Portland, and Santiago.\nSince we’re literally all over the map, communication using Slack, Gmail, Google Hangouts, and other tools is key for us. Don’t worry—you won’t be alone. We communicate regularly (and often with GIPHYs) throughout the day.\nEach team member uses highly specialized skills while working on a variety of projects. We enjoy giving our team members autonomy to do the work that interests them. We’re focused on the output of each team member, not putting in long hours.\nWe’re always open to new ways to create better content and make Student Loan Hero better for student loan borrowers, and we want to hear new ideas from you. A large part of our culture and values is transparency. We believe that team members should collaborate and communicate, not compete or engage in office politics.\nAt the same time, we like to make work as much fun as possible. We want everyone on our team to grow both personally and professionally, which is why we offer pretty damn awesome benefits and perks like unlimited vacation time and student loan repayment assistance.\nAbove all, we’re each proud to work on solving meaningful problems and to impact lives every day. Whether it’s authoring a blog post read by thousands of borrowers or answering a one-on-one customer support question, we value that working for Student Loan Hero makes a positive impact.\nRequired:\n\n2+ years experience as a copywriter\nA focus on conversion and getting results from the copy you write\nAbility to propose and help carry out A/B tests on copy\nExperience across multiple formats including email and web pages\nAbility to infuse copy with the SLH voice and brand\nAbility to work with a design team to create and match copy with UX\nFamiliarity with SEO best practices\nInterest in personal finance and helping others improve their financial lives\nAvailability to work full time\n\nPreferred:\n\nUnderstanding of A/B testing and related software\nExperience working on PPC and other paid campaigns\nFamiliarity with email marketing platforms and automation\nFamiliarity with WordPress\nExperience writing for landing pages\n\nBENEFITS\n\nCompetitive salary: $55,000 – $75,000, based on experience and location.\nEquity: We’ll give you vested shares in the company.\nVacation:Unlimited!\nFlexible hours: Work when you’re most productive.\nWork remotely: Work from wherever you want in the world (Costa Rica, anyone?)\nNew equipment: We’ll hook you up with a $2,000 technology stipend to purchase a laptop or whatever helps you work.\nRemote workspace: We’ll pay up to $500/month for a remote office space (e.g., co-working space).\nWellness: Up to $450/month for wellness-related expenses, including health insurance and gym membership.\nContinuing education: Up to $100/month for courses, books, or anything you’d like to learn!\nFinancial contribution: Receive a 100% match of up to 3% of annual salary to a retirement account, or a 100% match of up to 3% of annual salary toward student loan repayment assistance.\n\n",
      "state": "imported",
      "highlight": false,
      "createdAt": "2017-02-17T22:57:20.000Z",
      "id": "0268a464-2303-4bff-a19d-4ecfd00da887",
      "provider": "jobspresso",
      "providerId": "12681",
      "updatedAt": "2017-02-17T22:49:07.273Z"
    },
    {
      "category": "Developer",
      "position": "Senior Front-End Software Developer",
      "url": "https://boards.greenhouse.io/github/jobs/596296",
      "remote": false,
      "location": "Anywhere in US",
      "company": "GitHub",
      "companyUrl": "https://jobspresso.co/company/GitHub/",
      "companyAbout": "\n                    About GitHub\n                    GitHub is the best place to share code with friends, co-workers, classmates, and complete strangers. Over nine million people use GitHub to build amazing things together. With the collaborative features of GitHub.com, our desktop and mobile apps, and GitHub Enterprise, it has never been easier for individuals and teams to write better code, faster.\nYou will have a lot of exciting things to do, and you could grow with us!\nWhy you should join:\nWorking at GitHub is, to put it simply, a special slice of the universe. You could join us in our commitment to transparency, collaboration, experimentation, and always staying classy.\nBecause of this unique perspective, we've established one of the most flexible and well designed physical workspaces around that encourages you to work as you work best. Right now, over 60% of our employees are based outside of our San Francisco (SOMA) headquarters and work according to how they get their best stuff done. Remote GitHubbers also come visit SF often and are encouraged to stay as long as they like!\nEnsuring that you are healthy, motivated, focused and creative is how GitHub stays awesome. Part of this is ensuring that our benefits are out of this world.\nIn a nutshell, we've built and are growing a place in which you will truly love working.\n                ",
      "companyImage": "https://jobspresso.co/wp-content/uploads/2016/02/pBeeJQDQ_400x4001.png",
      "state": "imported",
      "highlight": false,
      "createdAt": "2017-02-16T11:00:00.000Z",
      "id": "0f7374e0-18d7-4dd1-8c67-b0012bfec18a",
      "provider": "jobspresso",
      "providerId": "12661",
      "updatedAt": "2017-02-17T22:49:07.284Z"
    }
  ]
}
